app/controllers/albums_controller.rb

SELECT `albums`.* FROM `albums`
---
  def index
    @albums = Album.all

SELECT `pics`.* FROM `pics` WHERE `pics`.`album_id` = 26
---
  def show
    @pics = @album.pics.all

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `albums` (`name`, `description`, `user_id`, `created_at`, `updated_at`) VALUES ('haha', 'hihi', 3, '2017-11-26 06:51:07', '2017-11-26 06:51:07')
INSERT INTO `pics` (`picture`, `created_at`, `updated_at`, `album_id`) VALUES ('1__11_.jpg', '2017-11-29 11:50:44', '2017-11-29 11:50:44', 11)
---
  def create
    @album = Album.new(album_params)
    @user = User.find_by_id @album.user_id
    #@albums = @user.albums.all

    respond_to do |format|
      if @album.save
        params[:pics]['picture'].each do |a|
           @pic = @album.pics.create!(:picture => a)

DELETE FROM `albums` WHERE `albums`.`id` = 25
---
  def destroy
    @album.destroy

SELECT  `albums`.* FROM `albums` WHERE `albums`.`id` = 25 LIMIT 1
---
    def set_album
      @album = Album.find(params[:id])