app/controllers/hashtags_controller.rb

SELECT `hashtags`.* FROM `hashtags`
---
  def index
    @hashtags = Hashtag.all