app/controllers/pics_controller.rb

  def index
    @pics = Pic.all
---
SELECT `pics`.* FROM `pics`

  def show
    @comments = @pic.comments.order(like_count: :desc).all
---
SELECT "comments".* FROM "comments" WHERE "comments"."pic_id" = ? ORDER BY "comments"."like_count" DESC  [["pic_id", 4]]

  def hashtag
<<<<<<< HEAD
    if params[:tag]
      @pics =Pic.tagged_with(params[:tag])
    else
      @pics = Pic.all
---
SELECT `pics`.* FROM `pics` INNER JOIN `taggings` ON `pics`.`id` = `taggings`.`pic_id` WHERE `taggings`.`tag_id` = 2
SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.`id` = `taggings`.`tag_id` WHERE `taggings`.`pic_id` = 1

  def create
    @pic = Pic.new(pic_params)
    @album = Album.find_by_id @pic.album_id
    #@pics = @user.pics.all

    respond_to do |format|
      if @pic.save
---
SELECT  `albums`.* FROM `albums` WHERE `albums`.`id` IS NULL LIMIT 1
INSERT INTO "pics" ("name", "description", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["picture", ""], ["created_at", "2017-11-21 10:08:57.045042"], ["updated_at", "2017-11-21 10:08:57.045042"]]

  def update
    respond_to do |format|
      if @pic.update(pic_params)
---
UPDATE `pics` SET `description` = 'Kawaiii <3 <3bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb', `updated_at` = '2017-11-28 11:14:24' WHERE `pics`.`id` = 1

  def destroy
    @pic.destroy
---
DELETE FROM "pics" WHERE "pics"."id" = ?  [["id", 1]]

    def set_pic
      @pic = Pic.find(params[:id])
---
SELECT  "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]