app/controllers/users_controller.rb

UPDATE `users` SET `user_name` = 'thotranuet97', `updated_at` = '2017-11-22 17:40:13' WHERE `users`.`id` = 3
---
  def update
    @user = current_user
    if @user.update(user_params)